Revit 2027 API
TableData.Width Property
 Gets or sets the table width in feet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
public:
property double Width {
	double get ();
	void set (double value);
}
member Width : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The table width is outside of the acceptable range.
See Also
Reference
TableData Class
Autodesk.Revit.DB Namespace